[
  {
    "title": "1",
    "rank": "1",
    "order": "1",
    "overlay": "right",
    "image": "01Curry.jpg",
    "credit": "Dean Rutz / Seattle Times",
    "name": "Linebacker Aaron Curry",
    "when": "2009, first round, fourth overall",
    "college": "Wake Forest",
    "career": "2009-11",
    "why": "Does it really need explaining? Curry was not only unproductive but hugely expensive, getting $34 million guaranteed before he played a down. That's almost $1 million for each of the 35 games Curry eventually played for the Seahawks, during which he managed 5.5 sacks and lots of uninspiring moments. The list of players Seattle could have taken instead is almost too depressing to think about. But here's one &mdash; linebacker Brian Cushing, drafted 15th overall by Houston. One wonders if/assumes the Pete Carroll/John Schneider regime, which came in a year later, might have gone a different direction with that pick."
  },
  {
    "title": "2",
    "rank": "2",
    "order": "2",
    "overlay": "right",
    "image": "02McGwire.jpg",
    "credit": "Bill Chan / AP",
    "name": "Quarterback Dan McGwire",
    "when": "1991, first round, 16th overall",
    "college": "San Diego State",
    "career": "1992-94",
    "why": "The selection of McGwire pretty much epitomizes all that went wrong during the Ken Behring era. Coach Chuck Knox apparently wanted to take Brett Favre &mdash; or just about anybody else &mdash; but Behring insisted on McGwire. Knox was so peeved that he didn't meet with reporters after the pick, as is the custom. McGwire lived down to Knox's expectations &mdash; starting just five games in four seasons, completing 74 of 148 career passes for 745 yards, with two touchdowns, six interceptions and a 52.3 rating. Favre, taken with the 33rd pick, had just a little bit more success."
  },
  {
    "title": "3",
    "rank": "3",
    "order": "3",
    "overlay": "",
    "image": "03Gill.jpg",
    "credit": "Harley Soltes / Seattle Times",
    "name": "Fullback Owen Gill",
    "when": "1985, second round, 53rd overall",
    "college": "Iowa",
    "career": "None\n",
    "why": "For the first time in franchise history, Seattle did not have a No. 1 pick in 1985, trading it two years prior to the Bengals for center Blair Bush. Gill, who had been the leading rusher in Iowa history, was Seattle's first pick, taken in the second round. But he never played a down for the Seahawks, released before the beginning of the season, typifying a draft that was fairly disastrous from top to bottom. Gill landed with the Colts, for whom he was a bit player for two seasons and then was dealt to the Rams as part of the Eric Dickerson trade. Seattle would have been better off doing what Dallas did &mdash; taking a gamble on Herschel Walker, then in the USFL. The Cowboys drafted Walker 114th overall."
  },
  {
    "title": "4",
    "rank": "4",
    "order": "4",
    "overlay": "",
    "image": "04Daniels.jpg",
    "credit": "Barry Wong / Seattle Times",
    "name": "Receivers Doug Thomas/David Daniels",
    "when": "1991, second round, 51st overall (Thomas), third round, 74th overall (Daniels)",
    "college": "Clemson/Penn State",
    "career": "1991-93",
    "why": "We're making this a dual entry, because it's difficult to distinguish between the two, both taken with the hope of replenishing a Seattle receiving corps still trying to replace Steve Largent, who had retired following the 1989 season. And because both failed in spectacularly similar fashion, leaving the Seahawks with holes at the receiving spot for years. You might have thought at least one of the two would have panned out. Instead, the two combined for 31 catches in three seasons before both were out of the NFL for good. If not for the picks of kicker John Kasay and defensive end Michael Sinclair in later rounds, the 1991 draft might go down as the worst in Seahawks history."
  },
  {
    "title": "5",
    "rank": "5",
    "order": "5",
    "overlay": "",
    "image": "05Bosworth.jpg",
    "credit": "Mike Powell / Getty",
    "name": "Linebacker Brian Bosworth",
    "when": "1987 supplemental draft",
    "college": "Oklahoma",
    "career": "1987-89",
    "why": "In a way, it's hard to blame the Seahawks for this one. In retrospect it almost seems like bad luck more than anything that the Seahawks won the supplemental draft and the rights to take Bosworth &mdash; which any team that won the draft would have done &mdash; and then were saddled with a player who couldn't live up to his college resume and saw his career derailed by injuries. Bosworth played just three lackluster seasons before his career was done. If Seattle had not won the rights to Bosworth it would have had the 20th pick in the first round in 1988. With that pick, the Rams took receiver Aaron Cox, though among the linebackers who were available then were Chris Spielman and Ken Norton Jr. "
  },
  {
    "title": "6",
    "rank": "6",
    "order": "6",
    "overlay": "",
    "image": "06Mirer.jpg",
    "credit": "Otto Greule Jr. / Getty",
    "name": "Quarterback Rick Mirer",
    "when": "1993, first round, second overall",
    "college": "Notre Dame",
    "career": "1993-96",
    "why": "So maybe this is another one where you'd excuse the Seahawks by noting that almost no one at the time questioned the pick of Mirer, who went second after the Patriots grabbed Drew Bledsoe (a pick the Patriots had only because Seattle had bothered to beat New England the previous season as one of the Seahawks' only two wins). The disaster that was the McGwire pick had Seattle still in need of a quarterback two years later, and at the time the selection of Mirer was greeted enthusiastically, especially when he went on to have a decent rookie season. But it was all downhill from there, and Mirer was out of Seattle three years later and never was a full-time starter again. Seattle would have been better off doing what Green Bay did that year &mdash; taking Mark Brunell with the 118th overall selection."
  },
  {
    "title": "7",
    "rank": "7",
    "order": "7",
    "overlay": "",
    "image": "07Jackson.jpg",
    "credit": "Nick Laham / Getty",
    "name": "Defensive End Lawrence Jackson",
    "when": "2008, first round, 28th overall",
    "college": "USC",
    "career": "2008-09",
    "why": "In its live blog of the 2008 draft, ESPN wrote that \"this is one of the most surprising picks in what has already been a surprising first round.\" Conversely, Mel Kiper Jr. liked the pick, writing that Jackson \"stepped up his performance and deserved being a first-round pick.\" Kiper, though, got this one wrong, as Jackson had just 6.5 sacks in two years before being traded. He was out of the NFL by 2013. Defensive ends Seattle could have taken instead included Calais Campbell, drafted in the second round, and Cliff Avril, taken by the Lions in the third. "
  },
  {
    "title": "8",
    "rank": "8",
    "order": "8",
    "overlay": "right",
    "image": "08King.jpg",
    "credit": "Stephen Dunn / Getty",
    "name": "Defensive Tackle Lamar King",
    "when": "1999, first round, 22nd overall",
    "college": "Saginaw Valley State",
    "career": "1999-2003",
    "why": "In Mike Holmgren's first draft with the Seahawks, the team reached a bit with King, from Division II Saginaw Valley State. King started 37 games for the Seahawks but simply didn't do much, other than a six-sack season in 2000. After that year, he struggled to stay in shape and had just three sacks the rest of his career. He was out of football by 2004. "
  },
  {
    "title": "9",
    "rank": "9",
    "order": "9",
    "overlay": "right",
    "image": "09Robinson.jpg",
    "credit": "Rod Mar / Seattle Times",
    "name": "Wide Receiver Koren Robinson",
    "when": "2001, first round, ninth overall",
    "college": "North Carolina State",
    "career": "2001-04, 2008",
    "why": "In some ways Robinson is tough to put on this list. He was hardly a total bust, turning in one of the better seasons for a receiver in Seahawks history in his second year with 78 catches for 1,240 yards. But from there it went downhill in a haze of personal issues, mostly related to substance abuse. And he was the ninth overall pick taken in a year when receivers such as Reggie Wayne and Chad Johnson went a little later."
  },
  {
    "title": "10",
    "rank": "10",
    "order": "10",
    "overlay": "right",
    "image": "10Tubbs.jpg",
    "credit": "Elaine Thompson / AP",
    "name": "Defensive Tackle Marcus Tubbs",
    "when": "2004, first round, 23rd overall",
    "college": "Texas",
    "career": "2004-07",
    "why": "Though we noted Kiper being wrong about Jackson, it's only fair to point out that sometimes he gets it right. Here's what Kiper wrote in 2004 about the pick of Tubbs: \"They needed a solid defensive tackle and Marcus Tubbs will be a boom or bust player at that position. If he can stay consistent for four quarters, though, he will be a big-time performer.\" Tubbs ultimately busted, showing up out of shape his rookie year, then getting hurt in his third season and out of the league by his fifth.  He did show a little promise with 53 tackles and 6.5 sacks in 24 starts his first two seasons, the latter of which was Seattle's first Super Bowl year. But not enough to keep him off this list. "
  }
]