[
  {
    "title": "1",
    "rank": "1",
    "order": "1",
    "overlay": "right",
    "image": "01Wilson.jpg",
    "credit": "Dean Rutz / Seattle Times",
    "name": "Quarterback Russell Wilson",
    "when": "2012, third round, 75th overall",
    "college": "Wisconsin",
    "career": "2012-present",
    "why": "Does it really need explaining? In three seasons Wilson has gone from questioned third-round pick to the most-accomplished quarterback in team history, leading the Seahawks to their first Super Bowl win and two Super Bowl appearances. And he is likely soon to become the highest-paid player in team history, if not NFL history."
  },
  {
    "title": "2",
    "rank": "2",
    "order": "2",
    "overlay": "right",
    "image": "02Sherman.jpg",
    "credit": "Mike Siegel / Seattle Times",
    "name": "Cornerback Richard Sherman",
    "when": "2011, fifth round, 154th overall",
    "college": "Stanford",
    "career": "2011-present",
    "why": "Seattle took a flyer on Sherman in the fifth round, and life has never been the same. Maybe forgotten is that Seattle got this pick from Detroit as part of a deal in which the Seahawks sent three picks, including their second, to the Lions for four picks. Of the four, only Sherman is still with the Seahawks, a case study in Seattle's theory on the value of hoarding draft picks."
  },
  {
    "title": "3",
    "rank": "3",
    "order": "3",
    "overlay": "",
    "image": "03Warner.jpg",
    "credit": "Mark Harrison / Seattle Times",
    "name": "Running Back Curt Warner",
    "when": "1983, first round, third overall",
    "college": "Penn State",
    "career": "1983-89",
    "why": "After the Seahawks had drafted a number of good, young defensive players in previous years &mdash; Jacob Green, Jeff Bryant, Kenny Easley &mdash; coach Chuck Knox arrived in 1983 and determined that the Seahawks were lacking one essential ingredient to be competitive &mdash; a top-flight running back. So Knox and GM Mike McCormack made maybe the most aggressive move in franchise history to that point, trading their first-, second- and third-round picks to Houston to move up from the No. 9 slot of the first round to get the Oilers' spot at No. 3 to acquire Warner, who finished third in the NFL with 1,449 yards as a rookie and led the Seahawks to the AFC Championship Game. A knee injury the following year proved costly. But Warner is rightly in the team's Ring of Honor."
  },
  {
    "title": "4",
    "rank": "4",
    "order": "4",
    "overlay": "right",
    "image": "04Jones.jpg",
    "credit": "Rod Mar / Seattle Times",
    "name": "Offensive Tackle Walter Jones",
    "when": "1997, first round, sixth overall\n",
    "college": "Florida State",
    "career": "1997-2009",
    "why": "Jones was the second of two first-round picks for Seattle in 1997, a year the Seahawks decided to get aggressive in what was the first draft with Paul Allen owning the team. Seattle traded up with Atlanta to get the third overall pick and chose cornerback Shawn Springs, and then traded up with Tampa Bay to get the sixth pick and take Jones. Springs had an erratic career &mdash; one Pro Bowl and 10 years as a starter, seven with Seattle &mdash; Jones could be the best player in franchise history and last year was enshrined in the Pro Football Hall of Fame.<p>In a stat oft-cited to illustrate his dominance, Jones was called for just nine holding penalties in his career. And he was the foundation of the team's first Super Bowl run in 2005, helping pave the way for all those Shaun Alexander TD runs."
  },
  {
    "title": "5",
    "rank": "5",
    "order": "5",
    "overlay": "right",
    "image": "05Kennedy.jpg",
    "credit": "Rod Mar / Seattle Times",
    "name": "Defensive Tackle Cortez Kennedy",
    "when": "1990, first round, third overall",
    "college": "Miami",
    "career": "1990-2000",
    "why": "Recall that the Seahawks traded the Nos. 8 and 10 overall picks (they had gotten an extra one in a trade of Fredd Young to Indianapolis a couple years earlier) to New England for Nos. 3 and 29. Seattle, though, wanted to do the trade only if it could get Kennedy, which meant that the Colts had to take Jeff George with the first pick and then the Jets Blair Thomas with the second to make it work. All of that happened, giving Seattle Kennedy, as well as linebacker Terry Wooden, who would go on to a solid career, with the 29th pick. The Patriots got linebacker Chris Singleton and defensive end Ray Agnew. Each lasted a while in the NFL, especially Agnew, who ended up starting for the Rams when they won the Super Bowl following the 1999 season. But neither was Kennedy, the second player in Seahawks history to make the Hall of Fame after spending his entire career with the team, joining Steve Largent."
  },
  {
    "title": "6",
    "rank": "6",
    "order": "6",
    "overlay": "",
    "image": "06Easley.jpg",
    "credit": "UPI Archive\n",
    "name": "Safety Kenny Easley",
    "when": "1981, first round, fourth overall",
    "college": "UCLA",
    "career": "1981-87",
    "why": "The Seahawks allowed 408 points in 1980, the most in the AFC, and needed defensive help wherever they could get it. Easley, who was a three-time consensus All-American at UCLA and finished ninth in the Heisman balloting in 1980, didn't disappoint, eventually earning five Pro Bowl appearances and being named the NFL Defensive Player of the Year when Seattle went 12-4 in 1984. Injuries, though, then began to hit, and Easley missed 13 games over the next three seasons before the somewhat messy ending to his Seattle career &mdash; a trade to Phoenix and a kidney ailment that forced him to retire age 29."
  },
  {
    "title": "7",
    "rank": "7",
    "order": "7",
    "overlay": "right",
    "image": "07Mawae.jpg",
    "credit": "Jed Jacobsohn / Getty",
    "name": "Center Kevin Mawae",
    "when": "1994, second round, 36th overall",
    "college": "LSU",
    "career": "1994-97",
    "why": "This one might seem a little off the beaten path. But for sure production, few Seahawks draftees have done more than Mawae &mdash; he played in the most games (241) of any Seattle draft pick other than kicker John Kasay (301), and in the second-most Pro Bowls (eight) of anyone other than Walter Jones (nine). The rub, obviously, is that he did little of that with the Seahawks, being signed away in free agency by the New York Jets after the 1997 season. It was with the Jets that Mawae blossomed to become acknowledged as one of the better centers in the NFL, generally considered one of the better of the decade of the 2000s. So yeah, it's a tricky one how much credit to give a team for drafting a player who turned out to have a standout career, yet let him get away before he could really do it for that team. The same argument could be made for Steve Hutchinson, who played five years with the Seahawks and made three of his seven Pro Bowls with Seattle before controversially departing after the Super Bowl season in 2005. Duly acknowledged. Maybe they should be a co-entry."
  },
  {
    "title": "8",
    "rank": "8",
    "order": "8",
    "overlay": "",
    "image": "08Sinclair.jpg",
    "credit": "Otto Greule Jr. / Getty",
    "name": "Defensive End Michael Sinclair",
    "when": "1991, sixth round, 155th overall",
    "college": "Eastern New Mexico",
    "career": "1991-2001",
    "why": "It's almost hard to give the Seahawks much credit for drafting Michael Sinclair in lower reaches of the 1991 draft when that class otherwise featured some of the most dubious selections in team history &mdash; notably, taking Dan McGwire in the first round in a year when a QB named Brett Favre was also available. WR Doug Thomas, who would make just 22 catches in three seasons before being done with the NFL, was almost as bad. But in the sixth round the Seahawks found a keeper that year in Sinclair, who had weight just 218 pounds out of high school and 248 out of college. His 73.5 career sacks are second in Seahawks history and the most of anyone in that class. And his 16.5 sacks in 1998 are the most ever by a Seahawk. He also made three consecutive Pro Bowls from 1996-98. "
  },
  {
    "title": "9",
    "rank": "9",
    "order": "9",
    "overlay": "right",
    "image": "09Chancellor.jpg",
    "credit": "Bettina Hansen / Seattle Times",
    "name": "Safety Kam Chancellor",
    "when": "2010, fifth round, 133rd overall",
    "college": "Virginia Tech",
    "career": "2010-present",
    "why": "The 2010 draft will go down as one of the best in Seahawks history, already yielding three Pro Bowlers in Russell Okung, Earl Thomas and Chancellor. He's where Seattle's reputation for finding late-round talent began&mdash; in the first year of the John Schneider/Pete Carroll regime. His selection wasn't widely noted in the immediate post-draft analysis, Seattle appearing simply to take a chance on a guy whose position seemed unclear &mdash; was he a linebacker or a safety? Schneider on draft day hinted at what the future would become while acknowledging just a little uncertainty: \"We just saw him as a big, physical presence.  Smart guy, all football.  He's played free safety, but he can play strong safety, too.  I'm not sure where the staff will be wanting to start him out, but if you were just looking at our draft in general, you can say that you've added a strong safety in Kam, and Earl [Thomas] would be a natural free safety.  But we'll see how all that stuff plays out.\""
  },
  {
    "title": "10",
    "rank": "10",
    "order": "10",
    "overlay": "",
    "image": "10Thomas.jpg",
    "credit": "John Lok / Seattle Times",
    "name": "Safety Earl Thomas",
    "when": "2010, first round, 14th overall",
    "college": "Texas",
    "career": "2010-present",
    "why": "Recall that the Seahawks had two first-round picks in 2010 &mdash; the No. 6, which was their own and was used to take Russell Okung, the team desperately needing a new left tackle with the retirement of Walter Jones. And then Seattle took Thomas with the No. 14 pick, which it got in one of the more remarkable moves in team history, a 2009 draft-day trade with Denver in which the Seahawks dealt their 2009 second-rounder for the Broncos' 2010 first-rounder. Denver wanted to move up to cornerback Alphonso Smith, who hasn't played since being with Detroit in 2010. Safety was an obvious need for the Seahawks, who had played in 2009 largely with the trio of Deon Grant, Jordan Babineaux and Lawyer Milloy. "
  }
]